package com.mredrock.cyxbs.freshman.bean
class SchoolItemBean {

    /**
     * code : 200
     * info : ok
     * update_date : 2019-08-12 13:20:01
     * text : [{"title":"报道必备","data":[{"name":"录取通知书","detail":""},{"name":"高考准考证","detail":""},{"name":"身份证","detail":""},{"name":"《新生适应性资料》学习心得","detail":""},{"name":"同版近期证件照15张","detail":"光面相纸洗印，白底一寸，半身，正面，免冠大头照"},{"name":"《学生管理与学生自律协议书》","detail":"入学指南中附带，请家长和学生认真阅读，并按要求签名，在入学报道时候交回给各学院"},{"name":"《致2018级新生的一封信》","detail":"入学指南中附带，请学生积极参加社会实践活动，并在入学报到时将社会实践报告交至各学院（如有图片，视频等资料请一并上交）"},{"name":"《重庆邮电大学社会实践表》","detail":"《实践表》电子版由学院发至新生群，需打印成纸质表。\r\n暑假进行志愿服务、实习等社会实践活动，填好后需盖有实践单位的公章方能有效。\r\n"},{"name":"团档案","detail":"学生自行准备，内含团员证、入团申请书等专团组织关系资料"}]},{"title":"军训用品","data":[{"name":"防暑药","detail":"藿香正气水等"},{"name":"花露水、驱蚊水","detail":"晚上军训时会有一些蚊虫，备上以防止蚊虫叮咬"},{"name":"风油精","detail":"提神醒脑。军训时需要早起，有些同学可能会睡眠不足，可以起到提神的功效。此外，风油精也会让人觉得特别清凉。"},{"name":"维C片、维E片","detail":"补充维生素，淡化黑色素，美白皮肤。"},{"name":"创可贴、棉签、碘伏","detail":"创可贴要随身带几枚，以备不时之需。"},{"name":"水杯","detail":"水杯最好是有盖子的，训练会大量出汗，休息时间有饮水点，备上可以随时补充水"},{"name":"发绳、发卡","detail":"军训时注重仪容仪表，长头发需要绑起来，刘海需要别起来，另外发卡也是卡帽子神器"},{"name":"厚鞋垫、卫生巾","detail":"军训发的鞋子会有点硬，大家请备好厚鞋垫或是垫鞋子的卫生巾。卫生巾可以吸汗，垫着也会更软一点，鞋子穿着了，站军姿、踢正步时会更有力量呐"},{"name":"运动袜","detail":"舒适、吸汗。另外，参加走方阵的同学按要求要穿深色的袜子"},{"name":"零钱","detail":"随身带零钱，以备不时之需"},{"name":"泡脚","detail":"军训训练强度会比较大，用热水泡脚既解乏，又利于睡眠"}]},{"title":"*以下为非必需","data":[{"name":"学籍档案","detail":"凡明确了档案由学生自带的省市，该省新生必须自带档案入学报到（学生不得私自拆封档案），报到时至学生所在学院。\r\n需邮寄档案的请寄至所在学院办公室，具体地址如下:\r\n\u201c重庆市南岸区南山街道崇文路2号重庆邮电大学XXX学院学生工作办公室\u201d\r\n"},{"name":"本人户口本内页","detail":"需办理户口迁移的重庆籍新生请携带该项到报道现场保卫处办理点办理\r\n户口迁入地址：重庆市南岸区南山街道崇文路2号附2号\r\n"},{"name":"《常住人口登记表》","detail":"需办理户口迁移的重庆籍新生请携带该项到报道现场保卫处办理点办理（需在原户籍所在地派出所办理）\r\n户口迁入地址：重庆市南岸区南山街道崇文路2号附2号\r\n"},{"name":"本人户口迁移证","detail":"需办理户口迁移的非重庆籍新生，需要该项及近期免冠一寸照片一张贴在迁移证左上角到报道现场保卫处办理点办理\r\n户口迁入地址：重庆市南岸区南山街道崇文路2号附2号\r\n"},{"name":"*党员档案","detail":""},{"name":"*转党组织关系相关资料","detail":"党员组织介绍信需由县级及县级以上的党委组织部门开具，使用新版的三联单介绍信\r\n重庆市外转入的，介绍信抬头写\u201c中共重庆市委教育工委组织干部处\u201d，去的单位写\u201c重庆邮电大学xx学院\u201d\r\n"},{"name":"*困难证明的原件和复印件","detail":"新生入学即可参加城乡低保，农村五保，享受国家助学金大学生以及重度（一，二级）残疾大学生等困难学生参保需提供其困难证明的原件及复印件。"}]}]
     */

    var code: Int = 0
    var info: String? = null
    var update_date: String? = null
    var text: List<TextBean>? = null

    class TextBean {
        /**
         * title : 报道必备
         * data : [{"name":"录取通知书","detail":""},{"name":"高考准考证","detail":""},{"name":"身份证","detail":""},{"name":"《新生适应性资料》学习心得","detail":""},{"name":"同版近期证件照15张","detail":"光面相纸洗印，白底一寸，半身，正面，免冠大头照"},{"name":"《学生管理与学生自律协议书》","detail":"入学指南中附带，请家长和学生认真阅读，并按要求签名，在入学报道时候交回给各学院"},{"name":"《致2018级新生的一封信》","detail":"入学指南中附带，请学生积极参加社会实践活动，并在入学报到时将社会实践报告交至各学院（如有图片，视频等资料请一并上交）"},{"name":"《重庆邮电大学社会实践表》","detail":"《实践表》电子版由学院发至新生群，需打印成纸质表。\r\n暑假进行志愿服务、实习等社会实践活动，填好后需盖有实践单位的公章方能有效。\r\n"},{"name":"团档案","detail":"学生自行准备，内含团员证、入团申请书等专团组织关系资料"}]
         */

        var title: String? = null
        var data: List<DataBean>? = null

        class DataBean {
            /**
             * name : 录取通知书
             * detail :
             */

            var name: String? = null
            var detail: String? = null
        }
    }
}
